#include <stdio.h>
#define YES 1
#define NO 0
int main(void)
{
​int c;​​​//текущий символ из потока
​int word;​​//признак слова
​int cnt;​​//счетчик
​int vowel_fnd; //индиактор того, что обнаржуена гласна буква
​int symb;​​//индикатор наличия лишних символов
​int prev_c;

​cnt = 0;
​word = NO;
​vowel_fnd = NO;
​symb = NO;
​printf("Please, enter some words:\n");
​prev_c = " ";

​while ((c = getchar()) != EOF) // цикл чтения символов из потока, связанного с клавиатурой
​{
​​if (c == ' ' || c == '.' || c == '\n' || c == ',' || c == '\t') // если найден разделитель, проверить...
​​{
​​​if (word == YES) //был ли это разделить после слова. Если да, проверить...
​​​{
​​​​if (vowel_fnd == YES) //была ли в слова обнаржуена глассная буква, если да проверить...
​​​​{
​​​​​if (symb == NO) //были ли в слове лишние символы, если нет, выполить...
​​​​​{
​​​​​​cnt = cnt + 1; //прибавить один к счетчику
​​​​​}
​​​​}
​​​}
​​​word = NO;
​​​vowel_fnd = NO;
​​​symb = NO;
​​}
​​else
​​{
​​​if (prev_c == ' ' || prev_c == '.' || prev_c == '\n' || prev_c == ',' || prev_c == '\t')
​​​{
​​​​if (c == 'e' || c == 'y' || c == 'u' || c == 'i' || c == 'o' || c == 'a' ||
​​​​​c == 'E' || c == 'Y' || c == 'U' || c == 'I' || c == 'O' || c == 'A')​//если после разделителей идет глассная буква, то выполнить
​​​​{
​​​​​vowel_fnd = YES;
​​​​}
​​​}
​​​if ((c < 'a' || c > 'z') && (c < 'A' || c > 'Z')) // проверить нет ли в слове лишних символов
​​​{
​​​​symb = YES; // если в слове есть лишний символ, поставить инд на "да"
​​​}
​​​word = YES;
​​}
​​prev_c = c;
​}
​printf("number of words with vowels on first position = %d\n", cnt); // вывесть значения счетчика
​return 0;
}
